Revit 2027 API
BalusterPlacement.BalusterPerTreadFamilyId Property
 The id of baluster per tread family.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BalusterPerTreadFamilyId { get; set; }
Public Property BalusterPerTreadFamilyId As ElementId
	Get
	Set
public:
property ElementId^ BalusterPerTreadFamilyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BalusterPerTreadFamilyId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The balusterPerTreadFamilyId doesn't refer to a valid baluster family.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The property defines a baluster family type which is used for creation of balusters on treads. The number of such balusters is set by "BalusterPerTreadNumber" property. It works only for stairs which have treads and have "UseBalusterPerTreadOnStairs" set.
See Also
Reference
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace